In [1]:
import pandas as pd
import numpy as np

In [2]:
# 適当なデータフレームを4つ作成
df1 = pd.DataFrame({
    'products':['水筒1', '水筒2'],
    'price':['1000', '2000']
})

df2 = pd.DataFrame({
    'products':['フライパン1', 'フライパン2'],
    'price':['1000', '2000']
})

df3 = pd.DataFrame({
    'products':['鍋1', '鍋2'],
    'price':['1000', '2000']
})

df4 = pd.DataFrame({
    'products':['傘1', '傘2'],
    'price':['1000', '2000']
})

## pd.concatで4つのデータフレームを一気に連結

In [3]:
concat_df = pd.concat([df1, df2, df3, df4])
concat_df

  price products
0  1000      水筒1
1  2000      水筒2
0  1000   フライパン1
1  2000   フライパン2
0  1000       鍋1
1  2000       鍋2
0  1000       傘1
1  2000       傘2

## pd.concatの引数に与える変数の順番を変えると結合される順番が変わる

In [4]:
concat_df2 = pd.concat([df1, df4, df2, df3])
concat_df2

  price products
0  1000      水筒1
1  2000      水筒2
0  1000       傘1
1  2000       傘2
0  1000   フライパン1
1  2000   フライパン2
0  1000       鍋1
1  2000       鍋2

In [5]:
concat_df3 = pd.concat([df1, df3, df4, df2])
concat_df3

  price products
0  1000      水筒1
1  2000      水筒2
0  1000       鍋1
1  2000       鍋2
0  1000       傘1
1  2000       傘2
0  1000   フライパン1
1  2000   フライパン2